DELETE
FROM scalping_quiz;
DELETE
FROM scalping_trivia;

INSERT INTO scalping_quiz (question, answer_correct)
VALUES ('Привет :wave:
Этот бот расскажет тебе всё, что нужно знать новичку о скальпинге
В боте ты узнаешь:
:point_right: *Что такое скальпинг?*
:point_right: *Методы торговли*
:point_right: *Особенности торговли методом скальпинга*
:point_right: *Преимущества скальпинга *
:point_right: *Минусы краткосрочной торговли*', 'Далее'),
--        ('', '', '', '', ''),
(':white_check_mark: *Что такое скальпинг?*
:point_right: *Методы торговли*
:point_right: *Особенности торговли методом скальпинга*
:point_right: *Преимущества скальпинга*
:point_right: *Минусы краткосрочной торговли*
Опытные участники рынка знают: резкая смена
тренда происходит не так часто\. Большую часть
времени на рынке происходят лишь небольшие
колебания на пару пунктов\. Получение прибыли
на таких мелких движениях котировок называют
*скальпингом*\.
 Скальпер использует каждое движение\.
Он совершает в течение дня десятки небольших
сделок, которые длятся по несколько минут\.
Доход с одной сделки может быть минимальным
— часто речь идет о прибыли всего в 1 пункт\.
Но за счет количества сделок трейдер может
закрыть торговый день с весьма ощутимым
доходом\.','Далее'),

(':white_check_mark: *Что такое скальпинг?*
:white_check_mark: *Методы торговли*
:point_right: *Особенности торговли методом скальпинга*
:point_right: *Преимущества скальпинга*
:point_right: *Минусы краткосрочной торговли*

Трейдер не ограничен в выборе торговых инструментов и площадок\. Если вы занимаетесь валютными сделками, это не мешает одновременно инвестировать в акции компаний\. Наоборот, этим вы увеличиваете шансы на хорошую прибыль\.

Вы можете параллельно осваивать валютную, товарную или фондовую биржу, рынок фьючерсов и опционов\.
У каждого инструмента свои особенности, но методы применяются к ним одни и те же: • Скальпинг и внутридневная торговля' ||
        '

:arrow_right: Среднесрочная торговля' ||
        '

:arrow_right: Долгосрочная торговля' ||
        '

 Начинающие трейдеры часто увлекаются торговлей внутри дня\. Это легко объясняется с психологической точки зрения — на начальном этапе всегда хочется быстрых денег\. Именно по этой причине в начале пути многие погружаются в индикаторы, прогнозы внутри дня и торговлю на более мелких таймфреймах — временных отрезках\.

Он имеет свои сильные и слабые стороны\.','Далее'),

(':white_check_mark: *Что такое скальпинг?*
:white_check_mark: *Методы торговли*
:white_check_mark: *Особенности торговли методом скальпинга*
:point_right: *Преимущества скальпинга*
:point_right: *Минусы краткосрочной торговли*
Скальпинг — это внутридневной стиль торговли с высокой частотой исполнения сделок\. Для скальпинга характерно короткое время удержания позиции\. За день трейдер может открыть и закрыть около 100 небольших сделок\.

Цель скальпинга: взять несколько пунктов в направленном движении цены\.

Минимум, на который ориентируется скальпер: выполнить обязательства по исполнению сделки и заработать 2\-4 пункта\.

При скальпинге очень важно выбрать подходящий момент для входа в рынок\. Лучше всего это делать во время уверенного продвижения тренда\. В таком случае позиция быстро достигает необходимого уровня прибыли и закрывается\. Либо трейдер продолжает следить за продвижением тренда, сдвигая при необходимости стоп\-лосс\. Как только тренд меняет направление — позиция закрывается ', 'Далее'),
(':white_check_mark: *Что такое скальпинг?*
:white_check_mark: *Методы торговли*
:white_check_mark: *Особенности торговли методом скальпинга*
:white_check_mark: *Преимущества скальпинга*
:point_right: *Минусы краткосрочной торговли*

Это метод торговли имеет и ощутимые плюсы:
• Возможность торговать на предпочитаемых активах\.
• Сокращение рисков ввиду коротких входов в рынок\.
• При открытии позиции по ходу движения цены можно получить прибыль на очень короткой дистанции\.
• Отследить небольшие колебания цены намного проще\.

Например, для любой ценной бумаги движение в 10 центов случается гораздо чаще, чем движение в 1 доллар\. • Скальпинг позволяет получать доход на каждом движении рынка\. Даже в периоды относительного рыночного спокойствия у скальперов всегда есть работа\.',
        'Далее'),
(':white_check_mark: *Что такое скальпинг?*

:white_check_mark: Методы торговли

:white_check_mark: Особенности торговли методом скальпинга

:white_check_mark: Преимущества скальпинга

:white_check_mark: Минусы краткосрочной торговли

У торговли короткими периодами есть свои особенности, которые обязательно надо брать в расчет\.

Будьте готовы к особой специфике:

• На дневном промежутке можно применить только особую группу стратегий\. Большинство существующих стратегий не подходят для данного стиля\.

• Частое открытие сделок заставляет в целом чаще рисковать\.

• Нагрузка на психику выше, чем при торговле в средний и долгий срок\. Нужна повышенная внимательность\. Это чревато усталостью и возможными ошибками\.', 'Далее');
-- INSERT INTO scalping_trivia (question, answer_correct)
-- VALUES ('Привет :wave:  Этот бот расскажет тебе всё, что нужно знать новичку о скальпинге  В боте ты узнаешь  :point_right: Что такое скальпинг?  :point_right: Методы торговли  :point_right: Особенности торговли методом скальпинга  :point_right: Преимущества скальпинга  :point_right: Минусы краткосрочной торговли', 'Далее'),
-- --        ('', '', '', '', ''),
--        (':white_check_mark: *Что такое скальпинг?*  :point_right: Методы торговли  :point_right: Особенности торговли методом скальпинга  :point_right: Преимущества скальпинга  :point_right: Минусы краткосрочной торговли  Опытные участники рынка знают: резкая смена
-- тренда происходит не так часто\. Большую часть
-- времени на рынке происходят лишь небольшие
-- колебания на пару пунктов\. Получение прибыли
-- на таких мелких движениях котировок называют
-- *скальпингом*\.  Скальпер использует каждое движение\.
-- Он совершает в течение дня десятки небольших
-- сделок, которые длятся по несколько минут\.
-- Доход с одной сделки может быть минимальным
-- — часто речь идет о прибыли всего в 1 пункт\.
-- Но за счет количества сделок трейдер может
-- закрыть торговый день с весьма ощутимым
-- доходом\.','Далее'),
--        ('Which operator can be used to compare two values?', '=='),
--        ('Which method can be used to return a string in upper case letters?', 'toUpperCase()'),
--        ('Which method can be used to find the length of a string?', 'length()'),
--        ('Which data type is used to create a variable that should store text?', 'String'),
--        ('How to insert a comment?', '// like this');


